{"config": [{"config": {"W_regularizer": null, "b_constraint": null, "nb_filter": 24, "input_dtype": "float32", "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "batch_input_shape": [null, 64, 64, 3], "activity_regularizer": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "b_regularizer": null, "nb_col": 5, "trainable": true, "name": "convolution2d_1", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "elu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_filter": 36, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "convolution2d_2", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "elu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_filter": 48, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "activity_regularizer": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "convolution2d_3", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "elu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_filter": 64, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "convolution2d_4", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "elu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "nb_filter": 64, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "name": "convolution2d_5", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "b_constraint": null, "output_dim": 1164, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "normal", "b_regularizer": null, "input_dim": null, "trainable": true, "name": "dense_1", "activation": "linear"}, "class_name": "Dense"}, {"config": {"p": 0.1, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_6", "activation": "elu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "output_dim": 100, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "normal", "b_regularizer": null, "input_dim": null, "trainable": true, "name": "dense_2", "activation": "linear"}, "class_name": "Dense"}, {"config": {"p": 0.1, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_7", "activation": "elu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "output_dim": 50, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "normal", "b_regularizer": null, "input_dim": null, "trainable": true, "name": "dense_3", "activation": "linear"}, "class_name": "Dense"}, {"config": {"p": 0.1, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_8", "activation": "elu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "output_dim": 10, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "normal", "b_regularizer": null, "input_dim": null, "trainable": true, "name": "dense_4", "activation": "linear"}, "class_name": "Dense"}, {"config": {"p": 0.1, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_9", "activation": "elu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "trainable": true, "name": "dense_5", "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_10", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "1.1.1", "class_name": "Sequential"}