{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_1", "activity_regularizer": null, "b_constraint": null, "nb_col": 5, "subsample": [2, 2], "bias": true, "nb_row": 5, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "trainable": true, "dim_ordering": "tf", "nb_filter": 24, "input_dtype": "float32", "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_2", "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "W_regularizer": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_filter": 36, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_3", "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "nb_row": 5, "W_regularizer": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_filter": 48, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_4", "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "nb_row": 3, "W_regularizer": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_5", "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "nb_row": 3, "W_regularizer": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 1164, "init": "normal", "b_regularizer": null, "bias": true, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"input_dim": null, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 100, "init": "normal", "b_regularizer": null, "bias": true, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"input_dim": null, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 50, "init": "normal", "b_regularizer": null, "bias": true, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"input_dim": null, "activation": "linear", "name": "dense_4", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 10, "init": "normal", "b_regularizer": null, "bias": true, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_9"}}, {"class_name": "Dense", "config": {"input_dim": null, "activation": "linear", "name": "dense_5", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_10"}}], "keras_version": "1.1.1"}